import random


# 지역
location = [
    ["서울", "강남"],
    ["서울", "건대"],
    ["서울", "성수"],
    ["서울", "잠실"],
    ["서울", "신촌"],
    ["서울", "홍대"],
    ["서울", "연신내"],
    ["서울", "대학로"],
    ["서울", "성신여대앞"],
    ["서울", "명동"],
    ["서울", "노원"],
    ["서울", "수유"],
    ["서울", "종로"],
    ["서울", "용산"],
    ["서울", "신림"],
    ["서울", "서울대 입구"],
    ["서울", "구로"],
    ["서울", "영등포"],
    ["서울", "천호"],
    ["서울", "이수"],
    ["서울", "왕십리"],
    ["서울", "회기"],
    ["서울", "노량진"],
    ["서울", "목동"],
    ["경기/인천", "안양"],
    ["경기/인천", "안산"],
    ["경기/인천", "군포"],
    ["경기/인천", "수원"],
    ["경기/인천", "화성"],
    ["경기/인천", "평택"],
    ["경기/인천", "용인"],
    ["경기/인천", "성남"],
    ["경기/인천", "이천"],
    ["경기/인천", "구리"],
    ["경기/인천", "동두천"],
    ["경기/인천", "의정부"],
    ["경기/인천", "일산"],
    ["경기/인천", "김포"],
    ["경기/인천", "부천"],
    ["경기/인천", "인천"],
    ['충청', '당진'],
    ['충청', '천안'],
    ['충청', '대전'],
    ['충청', '청주'],
    ['강원', '춘천'],
    ['강원', '원주'],
    ['강원', '강릉'],
    ['경상', '대구'],
    ['경상', '구미'],
    ['경상', '안동'],
    ['경상', '영주'],
    ['경상', '포항'],
    ['경상', '경주'],
    ['경상', '창원'],
    ['경상', '부산'],
    ['경상', '울산'],
    ['경상', '야산'],
    ['경상', '진주'],
    ["전라", "익산"],
    ["전라", "군산"],
    ["전라", "전주"],
    ["전라", "광주"],
    ["전라", "여수"],
    ["전라", "순천"],
    ["전라", "목포"],
    ["제주", "제주"],
]

lst = list()
cnt = [134, 77, 1, 34, 46, 137, 4, 46, 9, 3, 20, 13, 5, 5, 22, 5, 5, 12, 7, 4, 4, 4, 4, 5, 23, 17, 5, 60, 22, 18, 4, 30,
       5, 12, 5, 22, 43, 11, 26, 82, 4, 26, 65, 25, 9, 6, 5, 111, 4, 4, 4, 18, 4, 16, 142, 21, 11, 12, 11, 3, 55, 94,
       10, 4, 4, 23]

for i in range(len(cnt)):
    for j in range(cnt[i]):
        lst.append(i)

random.shuffle(lst)
print(lst)

result = list()

for i in range(10000):
    random.shuffle(lst)
    num = lst[0]
    result.append(num)

result.sort()

print(result)
