# 장르
genre = [
    "스릴러", 
    "로맨스",
    "추리",
    "SF/판타지",
    "모험/액션",
    "코미디", 
    "범죄", 
    "공포", 
    "19금",
    "감성/드라마",
]

# 지역
location = [
    ["서울", "강남"],
    ["서울", "건대"],
    ["서울", "성수"],
    ["서울", "잠실"],
    ["서울", "신촌"],
    ["서울", "홍대"],
    ["서울", "연신내"],
    ["서울", "대학로"],
    ["서울", "성신여대앞"],
    ["서울", "명동"],
    ["서울", "노원"],
    ["서울", "수유"],
    ["서울", "종로"],
    ["서울", "용산"],
    ["서울", "신림"],
    ["서울", "서울대 입구"],
    ["서울", "구로"],
    ["서울", "영등포"],
    ["서울", "천호"],
    ["서울", "이수"],
    ["서울", "왕십리"],
    ["서울", "회기"],
    ["서울", "노량진"],
    ["서울", "목동"],
    ["경기/인천", "안양"],
    ["경기/인천", "안산"],
    ["경기/인천", "군포"],
    ["경기/인천", "수원"],
    ["경기/인천", "화성"],
    ["경기/인천", "평택"],
    ["경기/인천", "용인"],
    ["경기/인천", "성남"],
    ["경기/인천", "이천"],
    ["경기/인천", "구리"],
    ["경기/인천", "동두천"],
    ["경기/인천", "의정부"],
    ["경기/인천", "일산"],
    ["경기/인천", "김포"],
    ["경기/인천", "부천"],
    ["경기/인천", "인천"],
    ['충청', '당진'],
    ['충청', '천안'],
    ['충청', '대전'],
    ['충청', '청주'],
    ['강원', '춘천'],
    ['강원', '원주'],
    ['강원', '강릉'],
    ['경상', '대구'],
    ['경상', '구미'],
    ['경상', '안동'],
    ['경상', '영주'],
    ['경상', '포항'],
    ['경상', '경주'],
    ['경상', '창원'],
    ['경상', '부산'],
    ['경상', '울산'],
    ['경상', '야산'],
    ['경상', '진주'],
    ["전라", "익산"], 
    ["전라", "군산"], 
    ["전라", "전주"], 
    ["전라", "광주"], 
    ["전라", "여수"], 
    ["전라", "순천"], 
    ["전라", "목포"], 
    ["제주", "제주"],
]

# 유저정보
# 연령 / 성별 / 인원수
user = [
    [10, "남", 1, 801],
    [10, "여", 801, 1601],
    [20, "남", 1601, 4101],
    [20, "여", 4101, 6601],
    [30, "남", 6601, 8101],
    [30, "여", 8101, 9601],
    [40, "남", 9601, 9801],
    [40, "여", 9801, 10001],
]

# 선호 (10대 남 -> 40대 여 순서 == 유저 정보 순서)
# 높은 선호 / 낮은 선호 / 비선호 / 제외
preference = [
    [["공포", "스릴러"], ["모험/액션", "추리"], ["로맨스", "감성/드라마"], ["19금"]], # 10대 남
    [["범죄", "스릴러"],["코미디", "모험/액션"],["공포"],["19금"]], # 10대 여
    [["공포", "스릴러"],["모험/액션", "SF/판타지"],["로맨스", "감성/드라마"],[]], # 20대 남
    [["스릴러", "추리"],["감성/드라마", "범죄"],["SF/판타지"],[]], # 20대 여
    [["공포", "스릴러"],["SF/판타지", "추리"],["로맨스", "감성/드라마"],[]], # 30대 남
    [["추리", "스릴러"],["감성/드라마", "범죄"],["SF/판타지"],[]], # 30대 여
    [["범죄", "추리"],["공포"],["로맨스", "감성/드라마"],[]], # 40대 남
    [["감성/드라마", "로맨스"],["코미디"],["범죄", "스릴러"],[]], # 40대 여
]

# 여기서부터 코드 시작>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
import random, json
# temp = random.randint(1, 10) 예시 1 ~ 10 랜덤 추출

data = {}  # json 저장용
data['users'] = []
lenUser = len(user)  # 유저 타입 개수
lenLocation = len(location)  # 지역 개수
lenGenre = len(genre)  # 장르 개수

lst = list()  # 지역 비율 조정용 코드
cnt = [134, 77, 1, 34, 46, 137, 4, 46, 9, 3, 20, 13, 5, 5, 22, 5, 5, 12, 7, 4, 4, 4, 4, 5, 23, 17, 5, 60, 22, 18, 4, 30,
    5, 12, 5, 22, 43, 11, 26, 82, 4, 26, 65, 25, 9, 6, 5, 111, 4, 4, 4, 18, 4, 16, 142, 21, 11, 12, 11, 3, 55, 94,
    10, 4, 4, 23]

for i in range(len(cnt)):
    for j in range(cnt[i]):
        lst.append(i)

for u in range(lenUser):  # 연령, 성별 기준으로
    age = user[u][0]  # 연령대
    gender = user[u][1]  # 성별

    for i in range(user[u][2], user[u][3]):  # 각각의 유저
        name = "익명의 유저"+str(i)
        genreScore = [0] * 10  # 한 사람의 장르별 점수

        # region = location[random.randint(0, lenLocation-1)]  # 한 사람의 지역 (랜덤)

        random.shuffle(lst)  # 지역 섞기
        region = location[lst[0]] # 한사람의 지역 (가중치)

        for g in range(lenGenre):  # 각각의 장르
            genreScore[g] = random.randint(0, 10)  # 장르 점수

            if genre[g] in preference[u][0]:  # 높은 선호
                genreScore[g] += 3
            elif genre[g] in preference[u][1]:  # 낮은 선호
                genreScore[g] += 1
            elif genre[g] in preference[u][2]:  # 비선호
                genreScore[g] -= 3
            elif genre[g] in preference[u][3]:  # 제외
                genreScore[g] = 0

            if genreScore[g] > 10:  # 범위 조정
                genreScore[g] = 10
            if genreScore[g] < 0:
                genreScore[g] = 1

        # print(name, age, gender, region, genreScore)
        data["users"].append({
            "name": name,
            "age": age,
            "location": region,
            "스릴러": genreScore[0], 
            "로맨스": genreScore[1],
            "추리": genreScore[2],
            "SF/판타지": genreScore[3],
            "모험/액션": genreScore[4],
            "코미디": genreScore[5], 
            "범죄": genreScore[6], 
            "공포": genreScore[7], 
            "19금": genreScore[8],
            "감성/드라마": genreScore[9],
        })

# json 파일로 생성
# with open("users3.json", 'w', encoding='UTF-8-sig') as file:
#     file.write(json.dumps(data, ensure_ascii=False))

                

